//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************
//<AMI_FHDR_START>
//
// Name: CRB.UNI
//
// Description: Chipset Reference Board setup string definitions 
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"
#langdef    x-UEFI-AMI "x-UEFI-AMI"   // AMI Configuration Language

#string STR_EMPTY                    #language eng  ""

#string STR_PCI_DEV_LIST_FORM        #language eng "PCIe Devices List"
                                     #language zh-chs "PCIe 设备列表"
#string STR_PCI_DEV_LIST_HELP	     #language eng "PCIe Devices List"
                                     #language zh-chs "PCIe 设备列表"
#string STR_NULL_STRING	             #language eng ""
                                     #language zh-chs ""
#string STR_SEPERATE_LINE	     #language eng "-----------------------------------------------"
                                 #language zh-chs "-----------------------------------------------"
#string STR_PCI_DEV_LIST_TITLE       #language eng "PCIe Device OptionROM Selection"
                                     #language zh-chs "PCIe卡固件设置"
#string STR_PCI_DEV_PER_CONTROL_TITLE       #language eng "PCIe Device Per-Control"
                                            #language zh-chs "PCIe设备"
#string STR_ENABLE		     #language eng "Enabled"
                             #language zh-chs "启用"
                             #language x-UEFI-AMI "Enabled"
#string STR_DISABLE		     #language eng "Disabled"
                             #language zh-chs "禁用"
                             #language x-UEFI-AMI "Disabled"
#string STR_PCI_DEV_OPROM_STRING     #language eng "  Option ROM"
                                     #language zh-chs "  PCIe卡固件"
#string STR_PCI_DEV_OPROM_STRING_HELP     #language eng "Select the execution of UEFI and Legacy OpROM"
                                          #language zh-chs "选择执行UEFI和传统OpROM"       
#string STR_PCI_DEV_CONTROL_HELP     #language eng "Enable/Disable PCIe Device"
                                     #language zh-chs "启用/禁用 PCIe设备"
#string STR_OPROM_POLICY_AUTO                               #language eng "Auto"
                                                            #language zh-chs "自动"
#string STR_PXE_OPROM_POLICY_EX                             #language eng "Network"
                                                            #language zh-chs "网络"                                        
                                                            #language x-UEFI-AMI "Network"
#string STR_PXE_OPROM_POLICY_HELP                           #language eng "Controls the execution of UEFI and Legacy PXE OpROM"
                                                            #language zh-chs "控制UEFI和Legacy OpROM的执行"                        
#string STR_MASS_STORAGE_OPROM_POLICY_EX                    #language eng "Storage"
                                                            #language zh-chs "存储"
                                                            #language x-UEFI-AMI "Storage"
#string STR_MASS_STORAGE_OPROM_POLICY_HELP                  #language eng "Controls the execution of UEFI and Legacy Storage OpROM"
                                                            #language zh-chs "控制UEFI和Legacy存储OpROM 的执行"
#string STR_VIDEO_OPROM_POLICY_EX                           #language eng "Video"
                                                            #language zh-chs "视频"
                                                            #language x-UEFI-AMI "Video"
#string STR_OLD_OPROM_LAUNCH_POLICY_EX                      #language eng "Other PCI devices"
                                                            #language zh-chs "其它"
                                                            #language x-UEFI-AMI "OtherPCIdevices"
#string STR_NVME_OPROM_POLICY                               #language eng "NVMe"
                                                            #language zh-chs "非易失性存储器"
                                                            #language x-UEFI-AMI "NVMe"
#string STR_NVME_OPROM_POLICY_HELP                          #language eng "Enabled,the NVMe device oprom will not be launched.NVMe Bus driver will manage the NVMe device"
                                                            #language zh-chs "启用后，NVMe设备的OpROM 将不会启动。NVMe总线驱动将管理NVMe设备。"
//<lvych001-20161215 Add both uefi and legacy policy support +>
#string STR_OPROM_POLICY_BOTH                               #language eng "UEFI and Legacy"
                                                            #language zh-chs "UEFI和Legacy"
//<lvych001-20161215 Add both uefi and legacy policy support ->

//<licm-20200921 Added Simplified Chinese to PCIE device list help message in Setup +>
#string STR_PCIE_DEV_OPTION_ROM_HELP                        #language eng "Select the execution of UEFI and Legacy OpROM\nMAC"
                                                            #language zh-chs "选择执行UEFI和传统 OpROM\nMAC"
#string STR_PCIE_DEV_ENABLE_DISABLE_HELP                    #language eng "Enable/Disable PCIe Device"
                                                            #language zh-chs "启用或禁用PCIe设备"
#string STR_PCIE_DEV_LOCATION_HELP                          #language eng "\nLocation     :"
                                                            #language zh-chs "\n位置    :"
#string STR_PCIE_DEV_BUSDEVFUNC_HELP                        #language eng "\nSeg/Bus/Dev/Func "
                                                            #language zh-chs "\n地址/总线/设备/功能 "
#string STR_PCIE_DEV_VENID_HELP                             #language eng "\nVendor ID        :"
                                                            #language zh-chs "\n厂商号  :" 
#string STR_PCIE_DEV_DEVID_HELP                             #language eng "\nDevice ID        :"
                                                            #language zh-chs "\n设备号  :" 
#string STR_PCIE_DEV_MAX_SPEED_HELP                         #language eng "\nMaximum Speed    :"
                                                            #language zh-chs "\n最大速度:"
#string STR_PCIE_DEV_MAX_WIDTH_HELP                         #language eng "\nMaximum Width    :"
                                                            #language zh-chs "\n最大宽度:"    
#string STR_PCIE_DEV_CURRENT_SPEED_HELP                     #language eng "\nCurrent Speed    :"
                                                            #language zh-chs "\n当前速度:"
#string STR_PCIE_DEV_CURRENT_WIDTH_HELP                     #language eng "\nCurrent Width    :"
                                                            #language zh-chs "\n当前宽度:" 
//<licm-20200921 Added Simplified Chinese to PCIE device list help message in Setup ->

//<bieyb-20180727 add function enable SRIOV by port+>
#string STR_PCI_DEV_SRIOV_STRING                            #language eng "  SR-IOV Support"
                                                            #language zh-chs "SR-IOV支持"
                                                            #language x-UEFI-AMI "SR-IOVSupport"
#string STR_PCI_DEV_SRIOV_STRING_HELP                       #language eng "This option Enables or Disables Single Root IO Virtualization Support."
                                                            #language zh-chs "启动或禁用SR-IOV支持."
//<bieyb-20180727 add function enable SRIOV by port->

#string STR_OPROM_POLICY_DISABLE                            #language eng         "Do not launch"
                                                            #language zh-chs      "禁用"
#string STR_OPROM_POLICY_UEFI_ONLY                          #language eng         "UEFI"
                                                            #language zh-chs      "UEFI"
#string STR_OPROM_POLICY_LEGACY_ONLY                        #language eng         "Legacy"
                                                            #language zh-chs      "Legacy"
#string STR_VIDEO_OPROM_POLICY_HELP                         #language eng         "Controls the execution of UEFI and Legacy Video OpROM" 
                                                            #language zh-chs      "控制UEFI和Legacy的视频OpROM的执行" 
#string STR_OLD_OPROM_LAUNCH_POLICY_HELP                    #language eng         "Determines OpROM execution policy for devices other than Network, Storage, or Video"
                                                            #language zh-chs      "确定除网络、存储或者视频之外的设备的OpROM执行规则 "


//<Yaosr-20201201 Set PCIe link speed by device. +>
#string STR_PCI_DEV_LnkSpeed_STRING                         #language eng "Link Speed Setting"
                                                            #language zh-chs "链接速度"
                                                            #language x-UEFI-AMI "LinkSpeedSetting"
#string STR_PCI_DEV_LnkSpeed_STRING_HELP                    #language eng "This option set PCIe link speed."
                                                            #language zh-chs "设置链接速度"
#string STR_2_5G                                            #language eng "Force to 2.5 GT/s"
                                                            #language zh-chs "2.5 GT/s"
#string STR_5_0G                                            #language eng "Force to 5.0 GT/s"
                                                            #language zh-chs "5 GT/s"
#string STR_8_0G                                            #language eng "Force to 8.0 GT/s"
                                                            #language zh-chs "8 GT/s"
#string STR_AUTO                                            #language eng "Auto"
                                                            #language zh-chs "Auto"
//<Yaosr-20201201 Set PCIe link speed by device. ->
//#string <string name>                 #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
